arch/sys-programming-overview.org
#+TITLE: 系统编程概要
#+AUTHOR: Cauchy(pqy7172@gmail.com)
#+EMAIL: pqy7172@gmail.com
#+HTML_HEAD: <link rel="stylesheet" href="../org-manual.css" type="text/css">

本系列文章是为系统软件开发者准备的，系统软件开发者是指编写操作系统，加载器，链接器，设备驱动或者其它请求访问系统资源的程序。这些系统软件通常只能提供给具有最高权限级的软件（CPL=0），权限以及它们的交互在后面的系列文章介绍。

本章主要介绍AMD64架构提供给系统软件开发者的基本功能，这些概念包括：
- 支持的地址形式以及内存是怎样组织的。
- 内存管理硬件是怎样利用各种形式的地址去访问内存。
- 处理器操作模式，以及内存管理是怎样支持这些模式的。
- 用来管理系统资源的系统控制器。
- 中断与异常机制，以及它们是怎样打断程序的执行从而报告错误。
- 此外，一些其它的功能也会提供给系统软件，包括硬件多任务的支持，报告Machine-check异常，调  试软件以及优化程序性能。

为了支持64-bit的操作系统和应用，许多遗留下来的功能个特性都有被加强，但同时也向后兼容已经存在的软件。

* 内存模型
* 内存管理
* 操作模式
* 系统寄存器
* 系统数据结构
* 中断
* 其它系统编程功能
